{
  "gfc_2008": [
    { "month": "2007-01", "marketCondition": "Subprime jitters surface but broader markets stay composed." },
    { "month": "2007-02", "marketCondition": "Mortgage delinquencies tick higher; risk appetite softens." },
    { "month": "2007-03", "marketCondition": "Credit desks keep a cautious tone as lending standards tighten." },
    { "month": "2007-04", "marketCondition": "Financials drift as investors weigh mortgage-backed exposure." },
    { "month": "2007-05", "marketCondition": "Growing concern around structured credit sparks mild volatility." },
    { "month": "2007-06", "marketCondition": "Funding costs creep up while equities begin to stall." },
    { "month": "2007-07", "marketCondition": "Credit markets flash stress; spreads widen considerably." },
    { "month": "2007-08", "marketCondition": "Liquidity tightens as credit markets reassess mortgage risk." },
    { "month": "2007-09", "marketCondition": "Central banks inject liquidity to calm money markets." },
    { "month": "2007-10", "marketCondition": "Earnings season highlights pressure on leveraged lenders." },
    { "month": "2007-11", "marketCondition": "Structured products reprice sharply; volatility stays elevated." },
    { "month": "2007-12", "marketCondition": "Year ends with defensive positioning and thin trading volumes." },
    { "month": "2008-01", "marketCondition": "Global equities slide as recession fears intensify." },
    { "month": "2008-02", "marketCondition": "Bank writedowns expand; investors favour safe haven assets." },
    { "month": "2008-03", "marketCondition": "Emergency bank rescues underscore mounting financial stress." },
    { "month": "2008-04", "marketCondition": "Markets stabilise briefly amid coordinated policy support." },
    { "month": "2008-05", "marketCondition": "Relief rally fades as credit metrics deteriorate again." },
    { "month": "2008-06", "marketCondition": "Oil prices surge, adding strain to fragile sentiment." },
    { "month": "2008-07", "marketCondition": "Government-sponsored entities face scrutiny; volatility resurfaces." },
    { "month": "2008-08", "marketCondition": "Funding markets remain brittle despite policy assurances." },
    { "month": "2008-09", "marketCondition": "Global panic accelerates after Lehman Brothers collapses." },
    { "month": "2008-10", "marketCondition": "Equities plunge as forced deleveraging sweeps through funds." },
    { "month": "2008-11", "marketCondition": "Policy makers craft rescue packages to restore confidence." },
    { "month": "2008-12", "marketCondition": "Year closes with historic losses despite massive interventions." },
    { "month": "2009-01", "marketCondition": "Risk sentiment remains fragile as layoffs and defaults rise." },
    { "month": "2009-02", "marketCondition": "Fresh capital injections stabilise key financial institutions." },
    { "month": "2009-03", "marketCondition": "Coordinated stimulus kindles the first signs of recovery." },
    { "month": "2009-04", "marketCondition": "Green shoots narrative builds as credit spreads narrow." },
    { "month": "2009-05", "marketCondition": "Stress tests calm nerves while cyclicals outperform." },
    { "month": "2009-06", "marketCondition": "Rally extends on improved economic surprises." },
    { "month": "2009-07", "marketCondition": "Earnings beat lowered expectations, supporting risk appetite." },
    { "month": "2009-08", "marketCondition": "Markets consolidate gains; volumes lighten over summer." },
    { "month": "2009-09", "marketCondition": "Recovery optimism lifts financials and industrials alike." },
    { "month": "2009-10", "marketCondition": "Investors debate exit strategies from extraordinary policy." },
    { "month": "2009-11", "marketCondition": "Global growth signals remain mixed but upward trending." },
    { "month": "2009-12", "marketCondition": "Markets end the year stronger as confidence slowly returns." }
  ],
  "covid_2020": [
    { "month": "2019-12", "marketCondition": "Virus headlines emerge; investors monitor global health alerts." },
    { "month": "2020-01", "marketCondition": "Initial outbreak sparks mild defensiveness in Asian markets." },
    { "month": "2020-02", "marketCondition": "Contagion worries intensify; travel and leisure lag sharply." },
    { "month": "2020-03", "marketCondition": "Lockdowns trigger the fastest bear market on record." },
    { "month": "2020-04", "marketCondition": "Massive fiscal and monetary support steadies sentiment." },
    { "month": "2020-05", "marketCondition": "Recovery hopes build as mobility data improves." },
    { "month": "2020-06", "marketCondition": "Stimulus-fueled rebound pushes growth and tech stocks higher." },
    { "month": "2020-07", "marketCondition": "Work-from-home beneficiaries extend their leadership." },
    { "month": "2020-08", "marketCondition": "Global PMI data signals expansion amid ongoing restrictions." },
    { "month": "2020-09", "marketCondition": "Market consolidates gains as virus cases reaccelerate." },
    { "month": "2020-10", "marketCondition": "Earnings season highlights resilience in digital-first sectors." },
    { "month": "2020-11", "marketCondition": "Vaccine breakthroughs lift reopening and travel names." },
    { "month": "2020-12", "marketCondition": "Year closes with strong equity performance led by tech." },
    { "month": "2021-01", "marketCondition": "Rotation into cyclicals begins as stimulus expectations rise." },
    { "month": "2021-02", "marketCondition": "Reflation trade accelerates; yields move higher." },
    { "month": "2021-03", "marketCondition": "Reopening momentum broadens the rally across sectors." },
    { "month": "2021-04", "marketCondition": "Earnings beats reinforce optimism about global growth." },
    { "month": "2021-05", "marketCondition": "Supply-chain strains emerge but sentiment stays upbeat." },
    { "month": "2021-06", "marketCondition": "Markets consolidate gains as policy support remains accommodative." }
  ],
  "inflation_2022": [
    { "month": "2021-09", "marketCondition": "Inflation readings surprise to the upside; bond yields creep higher." },
    { "month": "2021-10", "marketCondition": "Energy shortages keep price pressures elevated worldwide." },
    { "month": "2021-11", "marketCondition": "Central banks hint at tapering emergency stimulus." },
    { "month": "2021-12", "marketCondition": "Holiday demand stays firm despite rising costs." },
    { "month": "2022-01", "marketCondition": "Investors brace for rate hikes as inflation proves sticky." },
    { "month": "2022-02", "marketCondition": "Geopolitical tensions add fuel to commodity price spikes." },
    { "month": "2022-03", "marketCondition": "Energy shocks and supply strains keep price growth elevated." },
    { "month": "2022-04", "marketCondition": "Growth stocks lag as yields push sharply higher." },
    { "month": "2022-05", "marketCondition": "Volatility persists amid debates on soft-landing odds." },
    { "month": "2022-06", "marketCondition": "Central banks hike aggressively to tame runaway inflation." },
    { "month": "2022-07", "marketCondition": "Commodity prices retreat, offering a hint of relief." },
    { "month": "2022-08", "marketCondition": "Markets oscillate as inflation data remains uneven." },
    { "month": "2022-09", "marketCondition": "Higher-for-longer rhetoric keeps risk assets under pressure." },
    { "month": "2022-10", "marketCondition": "Corporate earnings flag margin compression from costs." },
    { "month": "2022-11", "marketCondition": "Cooling data sparks hopes for a slower hiking pace." },
    { "month": "2022-12", "marketCondition": "Cooling data hints at a slowdown while recession fears rise." },
    { "month": "2023-01", "marketCondition": "Markets balance disinflation progress with growth concerns." },
    { "month": "2023-02", "marketCondition": "Labour strength complicates the case for early rate cuts." },
    { "month": "2023-03", "marketCondition": "Markets weigh disinflation progress against growth headwinds." }
  ]
}
